---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.UptoHeightTooLow
source: html/6dda3c9b-ec2f-5a41-4aca-43288dce2f33.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.UptoHeightTooLow Property

Cutoff Level cannot be below bottom of roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId UptoHeightTooLow { get; }
```